<p style="font-family: Arial; font-size:3.75em;color:purple; font-style:bold"><br>
Pandas</p><br>

*pandas* is a Python library for data analysis. It offers a number of data exploration, cleaning and transformation operations that are critical in working with data in Python. 

*pandas* build upon *numpy* and *scipy* providing easy-to-use data structures and data manipulation functions with integrated indexing.

The main data structures *pandas* provides are *Series* and *DataFrames*. After a brief introduction to these two data structures and data ingestion, the key features of *pandas* this notebook covers are:
* Generating descriptive statistics on data
* Data cleaning using built-in pandas functions
* Frequent data operations for subsetting, filtering, insertion, deletion and aggregation of data
* Merging multiple datasets using dataframes
* Working with timestamps and time-series data

In [2]:
# This code appears in every demonstration Notebook.
# By default, when you run each cell, only the last output of the codes will show.
# This code makes all outputs of a cell show.
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Dictionary</p>
<br>
Dictionary is another data type in Python. Every element is a pair of key and value.

In [ ]:
# create a dictionary using {}, keys and values
gradebook = {}
gradebook['Captain'] = 87.0
gradebook['Thor'] = 94.0
gradebook['Hulk'] = 99.9
gradebook

In [ ]:
# To change the value of an element
gradebook['Hulk'] = [95.0, 97.0]
gradebook

In [ ]:
# To add an element to a dictionary
gradebook.update({'Vision': 98.9})
gradebook

In [ ]:
# What happens to sort a dictionary: it is sorted by key
sorted(gradebook)

In [ ]:
# Could you concatenate three dictionaries together?
dict1 = {1:10,2:20}
dict2 = {3:30,4:40}
dict3 = {5:50,6:60}

dict4 = {}
for d in (dict1, dict2, dict3):
    dict4.update(d)
dict4

In [ ]:
# We can use dictionary to create a program for log in
# Allow a user to type user name or password up to three attempts

logindi={'john':'12345','alice':'lovemum','james':'pokemon'}

# (code)
i = 0
while i < 3:
    print("Please type in your username: (attempt "+str(i+1)+")")
    #"please type in your username: (attempt "+1+")"
    username = input()
    if username in logindi:
       # (code)
        j = 0
        while j<3:
            print("Please type in your password: (attempt "+str(j+1)+")")
            password = input()
            if password == logindi[username]: # identifying matching password
                print("You logged in.")
                break
            else:
                print("The password is not correct.")
                j+=1
        break
    else:
        print("The username does not exist.")
        i+=1

In [ ]:
# Print out a dictionary
for k,v in logindi.items():
    print("username is", k, "and password is", v)

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Introduction to pandas Data Structures</p>
<br>
*pandas* has two main data structures it uses, namely, *Series* and *DataFrames*. 

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
pandas Series</p>

*pandas Series* are one-dimensional labeled arrays. Each value is corresponding to an index.

In [1]:
# import the libraries
import pandas as pd
import numpy as np

In [3]:
# When only values are provided, pandas uses integer index as default.
ser1=pd.Series([0.25,0.5,0.75,1]) # default indices
ser1
# The index can be explicitly defined: pd.Series(data, index)
ser2 = pd.Series([100, 'foo', 300, 'bar', 500], ['tom', 'bob', 'nancy', 'dan', 'eric'])
ser2

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

In [4]:
#Get the indices and values
ser2.index
ser2.values

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

array([100, 'foo', 300, 'bar', 500], dtype=object)

In [6]:
#You may construct a series from python dictionary.
# Key --> Index; Value -->Value
population_dict={'California':39512223,
                'Texas':28995881,
                'New York':19651127,
                'Florida':19552860,
                'Illinois':12882135}
population = pd.Series(population_dict)
population

California    39512223
Texas         28995881
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [ ]:
type(population)

In [7]:
#To access elements of series: using its own index or position index
population['Texas']
population[1]
# multiple items
population[['Texas', 'California']]
population[[1,0]]
population[0:2]
#loc[] or iloc[] to be more specific.
population.loc[['Texas', 'California']]
population.iloc[[1,0]]

28995881

28995881

Texas         28995881
California    39512223
dtype: int64

Texas         28995881
California    39512223
dtype: int64

California    39512223
Texas         28995881
dtype: int64

Texas         28995881
California    39512223
dtype: int64

Texas         28995881
California    39512223
dtype: int64

In [ ]:
#Check whether items in series
'Texas' in population

In [ ]:
# Operations on series; similar to arrays
population/1000000
population[['Texas', 'California']]/1000000

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
pandas DataFrame</p>

*pandas DataFrame* is a 2-dimensional labeled data structure.
### Three ways to create a DataFrame
    Dictionary of Pandas Series
    List of Dictionaries
    2-dimensional ndarrays

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Create DataFrame from Python dictionary of pd series</p>

In [5]:
# Each series becomes a column in Pandas DataFrame
# Indices are combined; no matched value to index is indicated with NaN
# Dictionary Keys as column names
d = {'one' : pd.Series([100., 200., 300.], index=['apple', 'ball', 'clock']),
     'two' : pd.Series([111., 222., 333., 4444.], index=['apple', 'ball', 'cerill', 'dancy'])}
df1 = pd.DataFrame(d)
df1

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [ ]:
#Create by specifying indices and columns
pd.DataFrame(d, index=['dancy', 'ball', 'apple'], columns=['two', 'five'])

In [ ]:
pd.DataFrame(d, columns=['two', 'five'])

In [ ]:
# Check data
df1.index
df1.columns
df1.values

In [11]:
#Create a state data frame
area_dict = {'California':423967,
                'Texas':695662,
                'New York':141297,
                'Florida':170312,
                'Illinois':57915}
area = pd.Series(area_dict)
area
# Generate the data frame using the dictionary of two series: population and area
states = pd.DataFrame({'population':population, 'area':area})
states

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois       57915
dtype: int64

            population    area
California    39512223  423967
Texas         28995881  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135   57915

In [14]:
states.iloc[2,0]

19651127

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Create DataFrame from list of Python dictionaries</p>

In [6]:
# Each dictionary is a row
# Each key is a column name; no matched value to key is indicated as NaN.
lstd = [{'alex':1,'joe':2},{'ema':5,'dora':10,'alex':20}]
df2 = pd.DataFrame(lstd)
df2

   alex  joe  ema  dora
0     1  2.0  NaN   NaN
1    20  NaN  5.0  10.0

In [ ]:
# Indices can be named and columns can be specified
pd.DataFrame(lstd, index = ['apple', 'orange'], columns = ['joe','dora','alex'])

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Create DataFrame from a 2-dimensional np arrays</p>

In [ ]:
# Specify index and column names
pd.DataFrame(np.random.rand(3,2),
             columns = ['apple','orange'],
             index = ['a','b','c'])

In [ ]:
pd.DataFrame(np.random.rand(3,2))

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Basic DataFrame operations</p>

In [ ]:
# The states DataFrame
states

In [ ]:
# To access rows and columns
# row name
states.loc['Texas']
# row position
states.iloc[1]
# column name
states['population']

# multiple rows
states.loc[['Texas', 'California']]
# multiple columns
states[['population', 'area']]
# slice
states.iloc[1:3, 0:2]

In [ ]:
# Create new variables
states['density'] = states['population']/states['area']
states['Large'] = states['population']>20000000
states['logpop'] = np.log2(states['population'])
states

In [ ]:
# Categorize a numerical variable
def popsize(x):
    if x <= 1.5e7:
        return "Small"
    elif 1.5e7 < x <= 2e7:
        return "Medium"
    return "Large"
states['StateSize'] = states['population'].apply(popsize)
states

In [ ]:
# delete variables
del states['density']
states.drop('logpop', axis = 1)
states

In [ ]:
# delete rows: to do it by youself

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Case Study: Movie Data Analysis</p>
<br>This notebook uses a dataset from the MovieLens website. We will describe the dataset further as we explore with it using *pandas*. 

## Download the Dataset

You can download the dataset from Canvas. For simplicity, save the Zip file to the same folder as your Notebook. Use "Unzip here" to extract it to the same folder.

Here are the links to the data source and location:
* **Data Source:** MovieLens web site
* **Location:** https://grouplens.org/datasets/movielens/

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Use Pandas to Read the Dataset<br>
</p>
<br>
Using the *read_csv* function in pandas, we can import the following CSV files:
<p>ratings.csv :userId,movieId,rating, timestamp</p>
<p>tags.csv :userId,movieId, tag, timestamp</p>
<p>movies.csv : movieId, title, genres</p> <br>

In [3]:
# import the libraries
import pandas as pd
import numpy as np

In [23]:
movies = pd.read_csv('./ml-latest-small/movies.csv')
print(type(movies))
movies.head(15)

<class 'pandas.core.frame.DataFrame'>

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller
10,11,"American President, The (1995)",Comedy|Drama|Romance
11,12,Dracula: Dead and Loving It (1995),Comedy|Horror
12,13,Balto (1995),Adventure|Animation|Children
13,14,Nixon (1995),Drama
14,15,Cutthroat Island (1995),Action|Adventure|Romance

In [71]:
# Timestamps represent seconds since midnight Coordinated Universal Time (UTC) of January 1, 1970
tags = pd.read_csv('./ml-latest-small/tags.csv')
tags.head()
tags.columns

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

Index(['userId', 'movieId', 'tag', 'timestamp'], dtype='object')

In [72]:
# import ratings
ratings = pd.read_csv('./ml-latest-small/ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [ ]:
movies.shape
ratings.shape

In [ ]:
movies.columns

In [ ]:
# For current analysis, we will remove timestamp
# Two ways to drop variables. drop() for DataFrame
tags.drop('timestamp', axis = 1, inplace = True)
tags.head()

In [ ]:
# del of Python
del ratings['timestamp']
ratings.head()

In [70]:
# the difference between drop() and del
tags.head()
ratings.head()

   userId  movieId              tag
0       2    60756            funny
1       2    60756  Highly quotable
2       2    60756     will ferrell
3       2    89774     Boxing story
4       2    89774              MMA

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

In [80]:
# Find unique values of a variable
ratings['rating'].unique()

array([4. , 5. , 3. , 2. , 1. , 4.5, 3.5, 2.5, 0.5, 1.5])

In [ ]:
# Check the size of the data set
movies.shape
tags.shape
ratings.shape

<h1 style="font-size:2em;color:#2467C0">Data Cleaning: Handling Missing Data</h1>

In [40]:
# identify whether there are missing values
movies.isnull()
movies.isnull().any()

      movieId  title  genres
0       False  False   False
1       False  False   False
2       False  False   False
3       False  False   False
4       False  False   False
...       ...    ...     ...
9737    False  False   False
9738    False  False   False
9739    False  False   False
9740    False  False   False
9741    False  False   False

[9742 rows x 3 columns]

movieId    False
title      False
genres     False
dtype: bool

In [42]:
# axis 1 or 0 gives whether there are missing values for each row or each column
# Default value for any() is axis = 0
movies.isnull().any(axis = 0)
movies.isnull().any(axis = 1)

movieId    False
title      False
genres     False
dtype: bool

0       False
1       False
2       False
3       False
4       False
        ...
9737    False
9738    False
9739    False
9740    False
9741    False
Length: 9742, dtype: bool

In [43]:
tags.isnull().any()

userId     False
movieId    False
tag        False
dtype: bool

In [44]:
ratings.isnull().any()

userId     False
movieId    False
rating     False
dtype: bool

### If there are missing values:
<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Choice 1: drop missing values</p>
<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Choice 2: impute with values</p>

In [20]:
d = {'one' : pd.Series([100., 200., 300.], index=['apple', 'ball', 'clock']),
     'two' : pd.Series([111., 222., 333., 4444.], index=['apple', 'ball', 'cerill', 'dancy']),
    'three': pd.Series(['Yes','No','Yes'], index = ['apple', 'ball', 'cerill'])}
df1 = pd.DataFrame(d)
df1

          one     two three
apple   100.0   111.0   Yes
ball    200.0   222.0    No
cerill    NaN   333.0   Yes
clock   300.0     NaN   NaN
dancy     NaN  4444.0   NaN

In [46]:
# Use our first dataframe as example
df1.isnull().any()

one      True
two      True
three    True
dtype: bool

In [47]:
# Choice 1: dropna()
df1.dropna()

         one    two three
apple  100.0  111.0   Yes
ball   200.0  222.0    No

In [11]:
# Choice 2: numerical variable - impute with mean or median
df1['one'] = df1['one'].fillna(df1['one'].mean())
df1['two'] = df1['two'].fillna(df1['two'].median())
df1

          one     two three
apple   100.0   111.0   Yes
ball    200.0   222.0    No
cerill  200.0   333.0   Yes
clock   300.0   277.5   NaN
dancy   200.0  4444.0   NaN

In [21]:
# value_counts count the number of observations for each category.
# the index of the first element in the output series is the one with most observations
# so we can select the index as the fillna() value
df1['three'].value_counts().index[0]

'Yes'

In [22]:
# Choice 2: categorical variable - impute with most common class
df1['three'] = df1['three'].fillna(df1['three'].value_counts().index[0])
df1

          one     two three
apple   100.0   111.0   Yes
ball    200.0   222.0    No
cerill    NaN   333.0   Yes
clock   300.0     NaN   Yes
dancy     NaN  4444.0   Yes

In [18]:
df1['three'].fillna('x', inplace = True)
df1

          one     two three
apple   100.0   111.0   Yes
ball    200.0   222.0    No
cerill    NaN   333.0   Yes
clock   300.0     NaN     x
dancy     NaN  4444.0     x

In [15]:
a = df1['three'].mode()
a

0    Yes
dtype: object

<h1 style="font-size:2em;color:#2467C0">Data Cleaning: Manipulating variables</h1>

In [58]:
# For movies table, what do we need to do?
# 1. Change genres into dummy variables
dummies = movies['genres'].str.get_dummies('|')
dummies.head()

,(no genres listed),Action,Adventure,Animation,Children,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0
1,0,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,1,0,0,0,0
4,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0

In [59]:
newmovies = pd.merge(movies, dummies, left_index = True, right_index = True)
newmovies.head()

,movieId,title,genres,(no genres listed),Action,Adventure,Animation,Children,Comedy,Crime,...,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,0,0,1,1,1,1,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji (1995),Adventure|Children|Fantasy,0,0,1,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
2,3,Grumpier Old Men (1995),Comedy|Romance,0,0,0,0,0,1,0,...,0,0,0,0,0,1,0,0,0,0
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,0,0,0,0,0,1,0,...,0,0,0,0,0,1,0,0,0,0
4,5,Father of the Bride Part II (1995),Comedy,0,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0

In [60]:
# 2. Check movie title. What can we do?
# Extacting Year out of title to create a new column
# Using regular expression
# extract() works on groups. It extracts groups specified in the regular expression. One column per group.
# expand = True adds the columns to the dataframe.
movies['year'] = movies['title'].str.extract('.*\(([0-9]*)\)', expand = True)
movies.head()

,movieId,title,genres,year
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji (1995),Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men (1995),Comedy|Romance,1995
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II (1995),Comedy,1995

<h1 style="font-size:1.5em;color:#2467C0">For tags and ratings tables: Parsing Timestamps</h1>

Timestamps are common in sensor data or other time series datasets.
Let us revisit the *tags.csv* dataset and read the timestamps!

<p style="font-family: Arial; font-size:1.35em;color:#2462C0; font-style:bold">

Unix time / POSIX time / epoch time records 
time in seconds <br> since midnight Coordinated Universal Time (UTC) of January 1, 1970
</p>

In [74]:
tags.head()
# Parsing the timestamp
tags['parsed_time'] = pd.to_datetime(tags['timestamp'], unit = 's')
tags.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

   userId  movieId              tag   timestamp         parsed_time
0       2    60756            funny  1445714994 2015-10-24 19:29:54
1       2    60756  Highly quotable  1445714996 2015-10-24 19:29:56
2       2    60756     will ferrell  1445714992 2015-10-24 19:29:52
3       2    89774     Boxing story  1445715207 2015-10-24 19:33:27
4       2    89774              MMA  1445715200 2015-10-24 19:33:20

In [ ]:
# Select rows based on time

In [75]:
# Get month
tags['month'] = pd.DatetimeIndex(tags['parsed_time']).month
tags.head()

   userId  movieId              tag   timestamp         parsed_time  month
0       2    60756            funny  1445714994 2015-10-24 19:29:54     10
1       2    60756  Highly quotable  1445714996 2015-10-24 19:29:56     10
2       2    60756     will ferrell  1445714992 2015-10-24 19:29:52     10
3       2    89774     Boxing story  1445715207 2015-10-24 19:33:27     10
4       2    89774              MMA  1445715200 2015-10-24 19:33:20     10

In [79]:
# Create a season variable based on month
# lambda function is good to apply operations to variables
tags['season'] = tags['month'].apply(lambda x: 'Spring' if 2<x<6 else
                                    ('Summer' if 5<x<9 else
                                     ('Fall' if 8<x<12 else 'Winter')
                                    )
                                   )
# Or if the lambda function is too complex, we can define a regular function and apply it.
'''
def season(x):
    if 2<x<6:
        return 'Spring'
    elif:
        
    elif:
        
    else:
'''
tags.head()
tags.tail()

"\ndef season(x):\n    if 2<x<6:\n        return 'Spring'\n    elif:\n        \n    elif:\n        \n    else:\n"

,userId,movieId,tag,timestamp,parsed_time,month,season
0,2,60756,funny,1445714994,2015-10-24 19:29:54,10,Fall
1,2,60756,Highly quotable,1445714996,2015-10-24 19:29:56,10,Fall
2,2,60756,will ferrell,1445714992,2015-10-24 19:29:52,10,Fall
3,2,89774,Boxing story,1445715207,2015-10-24 19:33:27,10,Fall
4,2,89774,MMA,1445715200,2015-10-24 19:33:20,10,Fall

,userId,movieId,tag,timestamp,parsed_time,month,season
3678,606,7382,for katie,1171234019,2007-02-11 22:46:59,2,Winter
3679,606,7936,austere,1173392334,2007-03-08 22:18:54,3,Spring
3680,610,3265,gun fu,1493843984,2017-05-03 20:39:44,5,Spring
3681,610,3265,heroic bloodshed,1493843978,2017-05-03 20:39:38,5,Spring
3682,610,168248,Heroic Bloodshed,1493844270,2017-05-03 20:44:30,5,Spring

<h1 style="font-size:2em;color:#2467C0">Filters for Selecting Rows</h1>

In [ ]:
# Select high ratings

In [ ]:
# Select animation movies

In [ ]:
# Multiple filters

<h1 style="font-size:2em;color:#2467C0">Group By and Aggregate </h1>

In [ ]:
# Find the number of observations for each rating value

In [ ]:
#Average rating of each movie

In [ ]:
# Find the total number of ratings for each movie

<h1 style="font-size:2em;color:#2467C0">Data Exploration</h1>

<p>Examine statistic features of variables</p>
<p>Create graphs</p>

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Numerical variables</p>

In [ ]:
# Statistics for numerical variables

In [ ]:
# Statistics for selected variables

In [ ]:
# Statistic functions
ratings['rating'].mean()
ratings['rating'].mode()
ratings['rating'].max()
ratings['rating'].std()

In [ ]:
# correlation

In [ ]:
%matplotlib inline
# Creating a histogram

In [ ]:
# Creating a boxplot

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Categocial variables</p>

In [ ]:
# Frequency count

In [ ]:
# A bar chart

<h1 style="font-size:2em;color:#2467C0">Merge Dataframes</h1>

In [ ]:
# Check tags and movies
tags.head()
movies.head()

In [ ]:
# Merge them by movieId
# inner join returns the intersection of the two dataframes

In [ ]:
# Or use pd.merge()

The other types of join include: 'outer', 'left', 'right'<br>
More examples: http://pandas.pydata.org/pandas-docs/stable/merging.html

In [ ]:
df3 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df4 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
df3
df4
#pd.merge(df3, df4)

In [ ]:
mergeinner = pd.merge(df3, df4, on = 'name', how = 'inner')
mergeinner

In [ ]:
mergeleft = pd.merge(df3, df4, on = 'name', how = 'left')
mergeleft

In [ ]:
mergeright = pd.merge(df3, df4, on = 'name', how = 'right')
mergeright

In [ ]:
mergeout = pd.merge(df3, df4, on = 'name', how = 'outer')
mergeout

<p style="font-family: Arial; font-size:1.35em;color:#2462C0; font-style:bold"><br>

For operations with strings in Pandas, more here: http://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods
<br> </p>